{"questions":["What is the largest planet in our solar system?",
      "What is the farthest human-made object from Earth?",
      "What is the process by which stars like our Sun generate energy?",
      "What is the largest known star in the universe?",
      "What is the term for a star that has exploded and become incredibly bright?",
      "What is the most distant galaxy ever observed?",
      "What is the term for a region of space where gravity is so strong that nothing can escape?",
      "What is the largest moon in our solar system?",
      "What is the term for a meteoroid that has entered a planet's atmosphere?",
      "What is the process by which galaxies collide and merge?",
      "What is the term for a star that is no longer generating energy through nuclear reactions?",
      "What is the largest known black hole in the universe?",
      "What is the term for a celestial object that orbits around a star?",
      "What is the process by which the universe became transparent to light?",
      "What is the term for a region of space where the density of galaxies is much higher than average?",
      "What is the largest known asteroid in our solar system?",
      "What is the term for a type of star that is extremely hot and bright?",
      "What is the process by which the universe expanded rapidly in the early stages of its formation?",
      "What is the term for a type of galaxy that is characterized by a large central bulge and spiral arms?",
      "What is the largest known comet in our solar system?",
      "What is the term for a type of celestial object that is thought to be the remains of a dead star?",
      "What is the process by which the universe became filled with light?",
      "What is the term for a type of galaxy that is characterized by a large central black hole?",
      "What is the largest known star-forming region in our galaxy?",
      "What is the term for a type of celestial object that is thought to be the remains of a supernova explosion?",
      "What is the process by which the universe became filled with matter?",
      "What is the term for a type of galaxy that is characterized by a large central bulge and no spiral arms?",
      "What is the largest known black hole at the center of a galaxy?",
      "What is the term for a type of celestial object that is thought to be the remains of a star that has undergone a supernova explosion?",
      "What is the process by which the universe became filled with galaxies?",
      "What is the term for a type of galaxy that is characterized by a large central bulge and a ring of stars?",
      "What is the largest known galaxy cluster in the universe?",
      "What is the term for a type of star that is extremely cool and dim?",
      "What is the process by which the universe became filled with heavy elements?",
      "What is the term for a type of galaxy that is characterized by a large central bulge and a disk of stars?",
      "What is the largest known star in the Milky Way galaxy?",
      "What is the term for a type of celestial object that is thought to be the remains of a star that has undergone a supernova explosion?",
      "What is the process by which the universe became filled with cosmic rays?",
      "What is the term for a type of galaxy that is characterized by a large central black hole and a disk of stars?",
      "What is the largest known black hole in the Milky Way galaxy?",
      "What is the term for a type of celestial object that is thought to be the remains of a star that has undergone a supernova explosion?",
      "What is the process by which the universe became filled with magnetic fields?",
      "What is the term for a type of galaxy that is characterized by a large central bulge and a halo of stars?",
      "What is the largest known galaxy in the local group?",
      "What is the term for a type of celestial object that is thought to be the remains of a star that has undergone a supernova explosion?",
      "What is the process by which the universe became filled with neutrinos?",
      "What is the term for a type of galaxy that is characterized by a large central black hole and a halo of stars?",
      "What is the largest known star-forming region in the Milky Way galaxy?",
      "What is the term for a type of celestial object that is thought to be the remains of a star that has undergone a supernova explosion?",
      "What is the process by which the universe became filled with gravitational waves?",
      "What is the term for a type of galaxy that is characterized by a large central bulge and a disk of stars?",
      "What is the largest known black hole at the center of a galaxy cluster?",
      "What is a black hole?",
    "What is the theory of relativity?",
    "How do we measure the distance to stars?",
    "What is the difference between a star and a planet?",
    "How does the Hubble Space Telescope work?",
    "What causes a supernova?",
    "Can you explain the concept of dark matter?",
    "What is the Big Bang Theory?",
    "What are exoplanets?",
    "How do black holes form?",
    "What is the role of gravity in space?",
    "What are quasars?",
    "What is the life cycle of a star?",
    "Can time travel be possible according to physics?",
    "What is a neutron star?",
    "How do we detect gravitational waves?",
    "What is the concept of spacetime?",
    "What is dark energy?",
    "What is the observable universe?",
    "What are asteroids and comets?",
    "What is the speed of light?",
    "Can you explain how the solar system formed?",
    "What is the role of the sun in our solar system?",
    "What are black holes made of?",
    "How do telescopes work?",
    "What are the key differences between a red giant and a white dwarf?",
    "What is the concept of the multiverse in astronomy?",
    "Can you explain the concept of the cosmic microwave background?",
    "What is the expanding universe theory?",
    "How do we explore space beyond our solar system?",
    "What is the significance of the Kepler Space Telescope?",
    "What are solar flares and how do they affect Earth?",
    "What is the Drake Equation?",
    "What is the Kuiper Belt?",
    "How does the process of nuclear fusion in stars work?",
    "What is the role of black holes in galaxy formation?",
    "What are cosmic rays?",
    "How do we know the universe is expanding?",
    "What are cosmic microwave background (CMB) photons?",
    "What are white dwarfs and how do they form?",
    "How is the age of the universe determined?",
    "What is the largest known star?",
    "What are the different types of galaxies?",
    "How do astronomers measure the age of stars?",
    "What is a wormhole?",
    "What is the difference between an asteroid and a meteoroid?",
    "What is the event horizon of a black hole?",
    "How do scientists study the formation of the solar system?",
    "What is gravitational lensing?",
    "What are neutron stars and how are they formed?",
    "Can you explain the concept of the space-time continuum?",
    "What is the Oort Cloud?",
    "What is the shape of the Milky Way galaxy?",
    "How does light pollution affect astronomical observations?",
    "What are the famous space missions that have explored other planets?",
    "How do stars emit light?",
    "What are the most common elements in the universe?",
    "What is the difference between elliptical and spiral galaxies?",
    "What is the observable universe and how do we know its size?",
    "What are the different types of solar eclipses?",
    "What is a redshift and how do we use it to measure the universe's expansion?",
    "How does the rotation of a planet affect its day-night cycle?",
    "What is the role of supermassive black holes in galaxies?",
    "How do scientists detect planets outside of our solar system?",
    "What are the stages of a supernova explosion?",
    "What are gravitational waves and how are they detected?",
    "What is the significance of the Andromeda galaxy?",
    "What are the key differences between a comet and an asteroid?",
    "How do space missions help us understand the formation of the universe?",
    "What is the concept of star formation?",
    "What is the Sun's role in the solar system's stability?",
    "What are gamma-ray bursts?",
    "What is the role of dark energy in the expansion of the universe?",
    "What is the closest planet to Earth?",
    "How do black holes form?",
    "What is the biggest star in the universe?",
    "How long does it take for light from the Sun to reach Earth?",
    "What are the different phases of the Moon?",
    "What is a supernova?",
    "What are exoplanets and how are they discovered?",
    "What is dark matter?",
    "How does the NASA Mars Rover send data back to Earth?",
    "What is the theory of cosmic inflation?",
    "What do we know about the Milky Way galaxy?",
    "What is the age of the universe?",
    "How do telescopes work?",
    "What is the significance of the Kuiper Belt?",
    "What are the primary challenges facing manned missions to Mars?",
    "What is the function of a space observatory?",
    "What was the Big Bang Theory?",
    "How are stars classified?",
    "What are meteor showers and how do they occur?",
    "What is the significance of the Hubble Space Telescope?",
    "What are solar flares?",
    "What phenomenon causes the Aurora Borealis?",
    "What is dark energy?",
    "How do scientists measure distances in space?",
    "What role do supermassive black holes play in galaxies?",
    "How do planets stay in orbit around the sun?",
    "What is the difference between a comet and an asteroid?",
    "What is the difference between a star and a planet?",
    "How do black holes form?",
    "What causes the different phases of the moon?",
    "Why do stars twinkle?",
    "What is the main difference between a meteor, meteoroid, and meteorite?",
    "How do telescopes work?",
    "What is the composition of Saturn's rings?",
    "Why is Pluto no longer considered a planet?",
    "What causes solar and lunar eclipses?",
    "How do scientists measure the distance to stars?",
    "What is the life cycle of a star?",
    "What are nebulae and how do they form?",
    "How does the Sun generate its energy?",
    "What is the current theory about how the Moon was formed?",
    "What are exoplanets and how do we detect them?",
    "What is dark matter and why do scientists think it exists?",
    "How do galaxies form and evolve?",
    "What causes auroras (northern and southern lights)?",
    "What is the difference between a comet and an asteroid?",
    "How do we know the age of the universe?",
    "What is the significance of the cosmic microwave background radiation?",
    "How do supernovas occur?",
    "What are gravitational waves and how are they detected?",
    "Why does Mars appear red?",
    "What is the Kuiper Belt?",
    "How do binary star systems work?",
    "What causes the seasons on Earth?",
    "What is the Great Red Spot on Jupiter?",
    "How do astronomers determine the chemical composition of stars?",
    "What is the Oort Cloud?",
    "How do neutron stars form?",
    "What are gamma-ray bursts?",
    "How do scientists study the atmosphere of other planets?",
    "What is the difference between spiral and elliptical galaxies?",
    "How do planetary rings form?",
    "What is stellar parallax?",
    "How do astronomers use spectroscopy?",
    "What causes solar flares?",
    "How do we know the Earth is round?",
    "What is the Goldilocks zone and why is it important?",
    "What is the difference between a star and a planet?",
    "How do black holes form?",
    "What causes the different phases of the moon?",
    "Why do stars twinkle?",
    "What is the main difference between a meteor, meteoroid, and meteorite?",
    "How do telescopes work?",
    "What is the composition of Saturn's rings?",
    "Why is Pluto no longer considered a planet?",
    "What causes solar and lunar eclipses?",
    "How do scientists measure the distance to stars?",
    "What is the life cycle of a star?",
    "What are nebulae and how do they form?",
    "How does the Sun generate its energy?",
    "What is the current theory about how the Moon was formed?",
    "What are exoplanets and how do we detect them?",
    "What is dark matter and why do scientists think it exists?",
    "How do galaxies form and evolve?",
    "What causes auroras (northern and southern lights)?",
    "What is the difference between a comet and an asteroid?",
    "How do we know the age of the universe?",
    "What is the significance of the cosmic microwave background radiation?",
    "How do supernovas occur?",
    "What are gravitational waves and how are they detected?",
    "Why does Mars appear red?",
    "What is the Kuiper Belt?",
    "How do binary star systems work?",
    "What causes the seasons on Earth?",
    "What is the Great Red Spot on Jupiter?",
    "How do astronomers determine the chemical composition of stars?",
    "What is the Oort Cloud?",
    "How do neutron stars form?",
    "What are gamma-ray bursts?",
    "How do scientists study the atmosphere of other planets?"
]}